Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAA176.atdf
         <module id="01643" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph_indep" name="PCACHE" name-in-module="PCACHE" offset="0x1f8e0000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph_pb2_std" name="PMP" name-in-module="PMP" offset="0x1f82e000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00159" name="RNG" version="">
            <instance name="RNG">
               <register-group address-space="periph_indep" name="RNG" name-in-module="RNG" offset="0x1f8e6000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPIN" version="">
            <instance name="RPIN">
               <register-group address-space="periph_pb1_std" name="RPIN" name-in-module="RPIN" offset="0x1f801404" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPOUT" version="">
            <instance name="RPOUT">
               <register-group address-space="periph_pb1_std" name="RPOUT" name-in-module="RPOUT" offset="0x1f801538" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00748" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph_pb6_std" name="RTCC" name-in-module="RTCC" offset="0x1f8c0000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00136" name="SB" version="">
            <instance name="SB">
               <register-group address-space="periph_ssx0" name="SB" name-in-module="SB" offset="0x1f8f8020" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00187" name="SDHC" version="">
            <instance name="SDHC">
               <register-group address-space="periph_indep" name="SDHC" name-in-module="SDHC" offset="0x1f8ec004" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph_pb2_std" name="SPI" name-in-module="SPI" offset="0x1f821000"/>
               <parameters>
                  <param name=""/>
               </parameters>
           </instance>
            <instance name="SPI2"/>
            <instance name="SPI3"/>
            <instance name="SPI4"/>
            <instance name="SPI5"/>
            <instance name="SPI6"/>
         </module>
         <module id="00206" name="SQI" version="">
            <instance name="SQI1">
               <register-group address-space="periph_indep" name="SQI" name-in-module="SQI" offset="0x1f8e2000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02141" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph_pb3_std" name="TMR1" name-in-module="TMR1" offset="0x1f840000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00745" name="TMR" version="">
            <instance name="TMR2">
            <register-group address-space="periph_pb3_std" name="TMR2" name-in-module="TMR2" offset="0x1f840200"/>
            <parameters>
               <param name=""/>
            </parameters>
            </instance>
            <instance name="TMR3"/>
            <instance name="TMR4"/>
            <instance name="TMR5"/>
            <instance name="TMR6"/>
            <instance name="TMR7"/>
            <instance name="TMR8"/>
            <instance name="TMR9"/>
         </module>
         <module id="02478" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph_pb2_std" name="UART" name-in-module="UART" offset="0x1f822000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="UART2"/>
            <instance name="UART3"/>
            <instance name="UART4"/>
            <instance name="UART5"/>
            <instance name="UART6"/>
         </module>
         <module id="00124" name="USB" version="">
            <instance name="USB">
               <register-group address-space="periph_indep" name="USB" name-in-module="USB" offset="0x1f8e3000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02831" name="USBCLKRST" version="">
            <instance name="USBCLKRST">
               <register-group address-space="periph_pb5_std" name="USBCLKRST" name-in-module="USBCLKRST" offset="0x1f8e4000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02674" name="WDT" version="">
            <instance name="WDT">
               <register-group address-space="periph_pb1_std" name="WDT" name-in-module="WDT" offset="0x1f800800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
