Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAA176.atdf
      <value-group caption="Early Interrupt Enable for Analog Input bit 4" name="ADCEIEN1__EIEN4">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 5" name="ADCEIEN1__EIEN5">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 6" name="ADCEIEN1__EIEN6">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 7" name="ADCEIEN1__EIEN7">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 8" name="ADCEIEN1__EIEN8">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 9" name="ADCEIEN1__EIEN9">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 10" name="ADCEIEN1__EIEN10">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 11" name="ADCEIEN1__EIEN11">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 12" name="ADCEIEN1__EIEN12">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 13" name="ADCEIEN1__EIEN13">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 14" name="ADCEIEN1__EIEN14">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 15" name="ADCEIEN1__EIEN15">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 16" name="ADCEIEN1__EIEN16">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 17" name="ADCEIEN1__EIEN17">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 18" name="ADCEIEN1__EIEN18">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 19" name="ADCEIEN1__EIEN19">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bit 20" name="ADCEIEN1__EIEN20">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
