Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAA176.atdf
      <value-group caption="Receiver Idle bit (read-only)" name="U6STA__RIDLE">
         <value caption="Receiver is Idle" name="" value="0x1" />
         <value caption="Data is being received" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Character Detect bit (bit 8 of received data = 1)" name="U6STA__ADDEN">
         <value caption="Address Detect mode is enabled. If 9-bit mode is not selected" name="" value="0x1" />
         <value caption="Address Detect mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U6STA__URXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full" name="" value="0x2" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full" name="" value="0x1" />
         <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Shift Register is Empty bit (read-only)" name="U6STA__TRMT">
         <value caption="Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)" name="" value="0x1" />
         <value caption="Transmit shift register is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit (read-only)" name="U6STA__UTXBF">
         <value caption="Transmit buffer is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Enable bit" name="U6STA__UTXEN">
         <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Break bit" name="U6STA__UTXBRK">
         <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits" name="" value="0x1" />
         <value caption="Break transmission is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Enable bit" name="U6STA__URXEN">
         <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Polarity Inversion bit" name="U6STA__UTXINV">
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 0 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 1" name="" value="0x1" />
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 1 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U6STA__UTXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2" />
         <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1" />
         <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Address Match Mask bits" name="U6STA__MASK">
         <value caption="Corresponding ADDRx bits are used to detect the address match" name="" value="0x1fe" />
         <value caption="Corresponding ADDRx bits are not used to detect the address match." name="" value="0x0" />
      </value-group>
   </module>

   <module caption="" id="00124" name="USB" version="1">
      <register-group name="USB">
         <register caption="USB Control Status Register 0" name="USBCSR0" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="FUNC" />
            <bitfield caption="Suspend Mode Enable bit" mask="0x00000100" name="SUSPEN" values="USBCSR0__SUSPEN" />
            <bitfield caption="Suspend Mode status bit" mask="0x00000200" name="SUSPMODE" values="USBCSR0__SUSPMODE" />
            <bitfield caption="Resume from Suspend control bit" mask="0x00000400" name="RESUME" values="USBCSR0__RESUME" />
            <bitfield caption="Module Reset Status bit" mask="0x00000800" name="RESET" values="USBCSR0__RESET" />
            <bitfield caption="Hi-Speed Mode Status bit" mask="0x00001000" name="HSMODE" values="USBCSR0__HSMODE" />
            <bitfield caption="Hi-Speed Enable bit" mask="0x00002000" name="HSEN" values="USBCSR0__HSEN" />
            <bitfield caption="Soft Connect/Disconnect Feature Selection bit" mask="0x00004000" name="SOFTCONN" values="USBCSR0__SOFTCONN" />
            <bitfield caption="ISO Update bit (" mask="0x00008000" name="ISOUPD" values="USBCSR0__ISOUPD" />
            <bitfield caption="Endpoint 0 Interrupt bit" mask="0x00010000" name="EP0IF" values="USBCSR0__EP0IF" />
            <bitfield caption="Endpoint 1 TX Interrupt Flag bit" mask="0x00020000" name="EP1TXIF" values="USBCSR0__EP1TXIF" />
            <bitfield caption="Endpoint 2 TX Interrupt Flag bit" mask="0x00040000" name="EP2TXIF" values="USBCSR0__EP2TXIF" />
            <bitfield caption="Endpoint 3 TX Interrupt Flag bit" mask="0x00080000" name="EP3TXIF" values="USBCSR0__EP3TXIF" />
            <bitfield caption="Endpoint 4 TX Interrupt Flag bit" mask="0x00100000" name="EP4TXIF" values="USBCSR0__EP4TXIF" />
            <bitfield caption="Endpoint 5 TX Interrupt Flag bit" mask="0x00200000" name="EP5TXIF" values="USBCSR0__EP5TXIF" />
            <bitfield caption="Endpoint 6 TX Interrupt Flag bit" mask="0x00400000" name="EP6TXIF" values="USBCSR0__EP6TXIF" />
            <bitfield caption="Endpoint 7 TX Interrupt Flag bit" mask="0x00800000" name="EP7TXIF" values="USBCSR0__EP7TXIF" />
         </register>
         <register caption="USB Control Status Register 1" name="USBCSR1" offset="0x4" rw="RW" size="4">
            <bitfield caption="Endpoint 1 RX Interrupt bit" mask="0x00000002" name="EP1RXIF" values="USBCSR1__EP1RXIF" />
            <bitfield caption="Endpoint 2 RX Interrupt bit" mask="0x00000004" name="EP2RXIF" values="USBCSR1__EP2RXIF" />
            <bitfield caption="Endpoint 3 RX Interrupt bit" mask="0x00000008" name="EP3RXIF" values="USBCSR1__EP3RXIF" />
            <bitfield caption="Endpoint 4 RX Interrupt bit" mask="0x00000010" name="EP4RXIF" values="USBCSR1__EP4RXIF" />
            <bitfield caption="Endpoint 5 RX Interrupt bit" mask="0x00000020" name="EP5RXIF" values="USBCSR1__EP5RXIF" />
            <bitfield caption="Endpoint 6 RX Interrupt bit" mask="0x00000040" name="EP6RXIF" values="USBCSR1__EP6RXIF" />
            <bitfield caption="Endpoint 7 RX Interrupt bit" mask="0x00000080" name="EP7RXIF" values="USBCSR1__EP7RXIF" />
            <bitfield caption="Endpoint 0 Interrupt Enable bit" mask="0x00010000" name="EP0IE" values="USBCSR1__EP0IE" />
            <bitfield caption="Endpoint 1 Transmit Interrupt Enable bits" mask="0x00020000" name="EP1TXIE" values="USBCSR1__EP1TXIE" />
            <bitfield caption="Endpoint 2 Transmit Interrupt Enable bits" mask="0x00040000" name="EP2TXIE" values="USBCSR1__EP2TXIE" />
            <bitfield caption="Endpoint 3 Transmit Interrupt Enable bits" mask="0x00080000" name="EP3TXIE" values="USBCSR1__EP3TXIE" />
            <bitfield caption="Endpoint 4 Transmit Interrupt Enable bits" mask="0x00100000" name="EP4TXIE" values="USBCSR1__EP4TXIE" />
            <bitfield caption="Endpoint 5 Transmit Interrupt Enable bits" mask="0x00200000" name="EP5TXIE" values="USBCSR1__EP5TXIE" />
            <bitfield caption="Endpoint 6 Transmit Interrupt Enable bits" mask="0x00400000" name="EP6TXIE" values="USBCSR1__EP6TXIE" />
            <bitfield caption="Endpoint 7 Transmit Interrupt Enable bits" mask="0x00800000" name="EP7TXIE" values="USBCSR1__EP7TXIE" />
         </register>
